package com.briup.net;
/**
 * 记录用户信息
 * 1.MyServer、MyClient、ServerThread、ClientThread四个程序虽然已经完成了粗略的通信功能，每个客户端可以看到其它客户端发送的信息，但无法知道是哪个客户端发送的信息，这是因为服务器端从未记录过用户信息，当客户端使用Socket连接到服务器端之后，程序
 * 只是使用socketList集合保存了服务器端对应对应生成的Socket,并没有保存该Socket关联的客户信息 ；
 * 2.下面程序将考虑使用Map来保存用户状态信息，因为本程序将考虑实现私聊功能，也就是说一个客户端可以将信息发送给另一个指定客户端，实际上，所有客户端只与服务器端连接，客户端之间并没有互相连接，也就是说，当一个客户端信息发送到服务器端之后，服务器端必须可以判断
 * 该信息到底是向所有用户发送，还是向指定用户发送，并需要知道向哪个用户发送，这里需要解决如下两个问题
 * a:客户端发来的信息必须有特殊的标识----让服务器端可以判断是公聊信息，还是私聊信息
 * b:如果是私聊信息，客户端会发送该消息的目的用户（私聊对象）给服务器端，服务器端如何将该消息发送给该私聊对象
 * ----------------------------------------------------------------------------------------------------------------
 * 为了解决问题a，可以让客户端在发送不同信息之前，先对这些信息进行适当处理，比如在内容前后添加一些特殊字符——这些特殊字符被称为协议字符，如下接口专门用于定义协议字符
 * @author WE
 *
 */
//实际上由于服务器和客户端都需要使用这些协议字符串，所以程序需要在客户端和服务器端同时保留该接口对应的class文件
public interface CustomProtocol 
{
	//定义协议字符串的长度
	int PROTOCOL_LEN = 2;
	//下面是一些协议字符串，服务器端和客户端交换的信息都应该在前、后添加这种特殊字符串
	String MSG_ROUND = "§γ";
	String USER_ROUND = "∏∑";
	String LOGIN_SUCCESS = "1";
	String NAME_REP = "-1";
	String PRIVATE_ROUND = "★【";
	String SPLIT_SIGN = "※";

}
